app/Controllers/JenisObatViewController.php

SELECT *
FROM `kandungan`
---
    public function index()
    {
        $kandungan = $this->KandunganModel->findAll();