app/Controllers/KelolaObatViewController.php

    public function index()
    {
        $obat = $this->ObatModel->join('kandungan', 'obat.idkandungan = kandungan.idkandungan')->findAll();
---
SELECT *
FROM `obat`
JOIN `kandungan` ON `obat`.`idkandungan` = `kandungan`.`idkandungan`

    public function tambah()
    {
        $data = [
            'title' => 'Tambah Obat',
            'kandunganobat' => $this->KandunganModel->findAll(),
---
SELECT *
FROM `kandungan`

    public function edit($id)
    {
        $data = [
            'title' => 'Edit Obat',
            'obat' => $this->ObatModel->find($id),
            'kandungan' => $this->KandunganModel->findAll(),
---
SELECT *
FROM `kandungan`