app/Controllers/KelolaObatController.php

    public function tambah()
    {
        if ($this->request->getPost()) {
            $data = [
                'kode_obat' => $this->request->getPost('kode_obat'),
                'namaobat' => $this->request->getPost('namaobat'),
                'satuan' => $this->request->getPost('satuan'),
                'idkandungan' => $this->request->getPost('idkandungan'),
            ];
            $this->ObatModel->insert($data);
---
INSERT INTO `obat` (`kode_obat`, `namaobat`, `idkandungan`) VALUES ('KJK090', 'Zinet', '1')

    public function edit($id_obat)
    {
        $data['obat'] = $this->ObatModel->find($id_obat);
        $data['jenisobat'] = $this->KandunganModel->findAll();
        if ($this->request->getPost()) {
            $data = [
                'kode_obat' => $this->request->getPost('kode_obat'),
                'namaobat' => $this->request->getPost('namaobat'),
                'satuan' => $this->request->getPost('satuan'),
                'idkandungan' => $this->request->getPost('idkandungan')
            ];
            $this->ObatModel->update($id_obat, $data);
---
SELECT *
FROM `kandungan`
UPDATE `obat` SET `kode_obat` = 'KJK090', `namaobat` = 'Zinettt', `idkandungan` = '1'
WHERE `obat`.`kode_obat` IN ('KJK090')